[{"name":"Real","science":" Gardening on the Web since 1997","description":""},{"name":"","science":"","description":""},{"name":"","science":"","description":" "},{"name":"","science":"The Garden HelperThe Gardener's ForumForum ArchiveGarden CalendarGardening in OctoberGardening BasicsPlanting & GrowingPlants by GroupGarden Specific PlantsHouse PlantsPlant Buying GuidePlant Hardiness ZonesPests & ProblemsStart Seed IndoorsGarden Tool CareGarden GlossaryPlant Care IconsPlant Buying GuidePlant IndexEncyclopediaCookies!","description":"\n "},{"name":"","science":"The Garden HelperThe Gardener's ForumForum ArchiveGarden CalendarGardening in OctoberGardening BasicsPlanting & GrowingPlants by GroupGarden Specific PlantsHouse PlantsPlant Buying GuidePlant Hardiness ZonesPests & ProblemsStart Seed IndoorsGarden Tool CareGarden GlossaryPlant Care IconsPlant Buying GuidePlant IndexEncyclopediaCookies!","description":"Cookies!"},{"name":"","science":"The Garden Helper","description":"The Garden Helper"},{"name":"","science":"The Gardener's Forum","description":"The Gardener's Forum"},{"name":"","science":"Forum Archive","description":"Forum Archive"},{"name":"","science":"Garden Calendar","description":"Garden Calendar"},{"name":"","science":"Gardening in October","description":"Gardening in October\n"},{"name":"","science":"Gardening Basics","description":"Gardening Basics"},{"name":"","science":"Planting & Growing","description":"Planting & Growing"},{"name":"","science":"Plants by Group","description":"Plants by Group"},{"name":"","science":"Garden Specific Plants","description":"Garden Specific Plants"},{"name":"","science":"House Plants","description":"House Plants"},{"name":"","science":"Plant Buying Guide","description":"Plant Buying Guide"},{"name":"","science":"Plant Hardiness Zones","description":"Plant Hardiness Zones"},{"name":"","science":"Pests & Problems","description":"Pests & Problems"},{"name":"","science":"Start Seed Indoors","description":"Start Seed Indoors"},{"name":"","science":"Garden Tool Care","description":"Garden Tool Care"},{"name":"","science":"Garden Glossary","description":"Garden Glossary"},{"name":"","science":"Plant Care Icons","description":"Plant Care Icons"},{"name":"","science":"Plant Buying Guide","description":"Plant Buying Guide"},{"name":"","science":"Plant Index","description":"Plant Index"},{"name":"","science":"Encyclopedia","description":"Encyclopedia"},{"name":"","science":"Cookies!","description":"Cookies!"},{"name":"MostsomewhereeverySaintpaulia ionanthaAloe barbadensisPilea cadiereiHippeastrumSyngonium podophyllumPilea microphyllaProtasparagus setaceusSoleirolia soleiroliiopenMusa nanaBegonia rex-cultorumStrelitzia reginaedirectAsplenium nidusThunbergia alataIresine herbstiiNephrolepis exaltataBougainvilliaJusticia carneaPinguicula vulgarissealedPellaea rotundifoliaCaladium bicolorSchlumbergera buckleyiLycopodium clavatumDarlingtonia californicashould be growncanCoffea arabicaCodiaeum variegatumEuphorbia miliisome direct sunCyclamen persicumDieffenbachiaDracaena marginataCryptanthus bromelioidesRhipsalidopsis gaertneriLilium longiflorum(June?)Portulacaria afraPhilo. bipinnatifidumSchefflera elegantissimaSchefflera elegantissimaCrossandra infundibuliformisClivia miniataEpiscia dianthifloraAnthurium speciesAbutilon hybridumP. densiflorus 'Meyeri'Pilea involucrataGardenia jasminoidesSinningia hybridushollow side upEpipremnum aureumPachystachys luteaHaworthia attenuataPhil. scandensEcheveria elegansEcheveria imbricataSempervivum tectorumBegonia masonianaHedera helixCrassula argenteaFatsia japonicaSolanum pseudocapsicumKalanchoe blossfeldianaLantana camaraAeschynanthus radicansAdiantum raddianumCitrus mitisPilea depressaPilea 'Moon Valley'sometimes you have to use your imagination..Rhoeo discolorFittonia verchaffeltiiAraucaria heterophyllaslightly cooler at nightColeus blumeiKalanchoe tomentosaChamaedorea elegans(or misting)Passiflora incarnataSpathiphyllum floribundum(never soggy)AlstroemeriaNertera granadensisSarracenia purpureaEcheveria pulvinataCalceolariaCalceolaria  crenatifloraEuphorbia pulcherimaHypoestes phyllostachyaCalliandraCalliandra haematocephalaMaranta leucoreuraOpuntia vulgarisGynura aurantiacaGoodyera pubescensBegonia hybridslightlyCeropegia woodiiFicus elasticaOxalis oregonaSansevieria trifasciatasparingly but regularlyChlorophytum comosumpreferPhil. pertusumP. densiflorus 'Sprengeri'Saxifraga stoloniferaDrosera capensisPlectranthus australisGibasis geniculata(not Tahiti)Zygocactus truncatusSedum spurium tricolorDionaea muscipulaTradescantia zebrinaPeperomia sandersiiBegonia semperflorensGaultheria procumbensAphelandra squarrosa","science":"African VioletSee Web PageAloe VeraSee Web PageAluminum PlantSee Web PageAmaryllisforce into bloomgift plantSee Web PageArrowhead VineSee Web PageArtillery Plantterrarium environmentsSee Web PageAsparagus FernSee Web Pagedish gardensopen terrariumsCan be propagated by divisionBanana Plantsfeeding when actively growing with soluble 20-20-20 fertilizerSee Web PageBegonia RexSee Web PageBird of ParadiseSee Web PageBlack Eyed Susan VineSee Web PageBoston FernsSee Web PageBougainvilleSee Web PageBrazilian Plume FlowerUSDA Zones 9-11See Web PageButterwortsSee Web PageSusceptible to attacks from scale insectsCaladiumFeed every 6 weeks with a liquid 6-6-6 fertilizerSee Web PageMitre FlowerSee Web PageChristmas CactusSee Web PageChristmas TreesSee Web PageCan be propagated by cuttingsCobra LilySee Web PageCoffee Plantsoluble, 10-10-10 fertilizerSee Web PageCrotonSee Web PageCrown of ThornsCan be propagated by cuttingsSee Web PageCyclamenSee Web PageDieffenbachiaSee Web PageDragon Treeair layeringcuttingsSee Web PageSusceptible to mealy bugs and scale insectsEaster CactusSee Web PageEaster LiliesSee Web PagePropagate by softwood cuttingsElephant Ear Philodendronliquid house plant fertilizerSee Web PageFalse AraliaFirecracker FlowerSee Web PageFire LilySee Web PageFlamingo FlowerSee Web PageFlowering MaplefertilizerSee Web PageFoxtail FernSee Web PageFriendship PlantSee Web PageGardeniawith an acidifying fertilizerSee Web PageGloxiniaSee Web PageGolden PothosSee Web PageGolden Shrimp PlantSee Web PageFeed in spring and again in the fall with half strength house plant fertilizerHeart Leaf PhilodendronSee Web PagePropagation is by softwood cuttingsIron Cross BegoniaSee Web PageIvyFeed monthly with half strength, balanced fertilizerSee Web PageJade plantSee Web PageJapanese Araliashade gardenpalmate leavesSee Web PageJerusalem Cherryliquid 5-10-5 blooming house plant fertilizerSee Web PageKalanchoeSee Web PageLantanaSee Web PageLipstick PlantSee Web PageMaidenhair FernSee Web PageMiniature Orange TreeSee Web PageMiniature PeperomiaSee Web PageMoon ValleyExcellent for terrariums or dish gardensSee Web Pagesoftwood cuttingsPropagate by softwood cuttings kept @ 75°Norfolk Island PineSee Web PageOrchidsOrnamental PeppersSow seeds of Ornamental Peppers into potsPainted NettlePropagate with cuttingsgrow from seed½ strength liquid house plant fertilizerSee Web PageFeed monthly when actively growingPropagation is by softwood cuttingsParlor PalmFeed in spring and summer onlySee Web PagePassion Flower10-5-20 ratio fertilizerPropagate with cuttingsgrow from seedPeace lilyliquid 20-20-20 fertilizerPeruvian LilySee Web PagePin Cushion PlantPitcher PlantsPropagation is by softwood cuttingsPouch FlowerSee Web PagePoinsettiaSee Web PagePolka Dot PlantPowder Puff Treeover-winter your plant indoorsSee Web PagePrayer PlantFeed with balanced \"acid fertilizer\"Prickly Pear CactusFeed monthly with ½ strength, house plant food when growingPurple Passion PlantPropagation is by softwood cuttingsslightly acidic soilFeed with compost teaPropagate by division in the springRieger Begoniadilute, water soluble houseplant fertilizer (15-30-15)Rosary VineFeed monthly with ½ strength house plant foodRubber Plantswith ½ strength house plant foodShamrocksall purpose house plant foodSnake PlantSpider PlantFeed every 3 months with house plant fertilizerSplit Leaf Philodendronliquid house plant fertilizerSprenger's AsparaguscladodesSee Web PageStrawberry BegoniaFeed monthly in summer with house plant fertilizerSundewSwedish IvyColeusracemesSee Web PageThanksgiving CactusPropagation is by softwood cuttingsVenus Fly TrapWandering JewFeed monthly while growing, with ½ strength house plant foodPropagate with softwood cuttings.Feed monthly in spring and summer with half-strength house plant foodWax BegoniaBegonia semperflorensSee Web PageZebra PlantAphelandra squarrosaSee Web PagePage Index","description":"\n "},{"name":"Mostsomewhereevery","science":"","description":"Flowering and Foliage House Plants\n\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n100 of the most Popular, Easy to Grow House Plants\nMost house plants are hybrids of plant species that grow wild, somewhere in the world\nA good rule of thumb for keeping your house plants healthy is to try to match the same environment from which they originated.\nYou may not be able to match every criteria for your house plant,\nbut every small step you take to ensure the plants comfort will be a giant step towards keeping them healthy."},{"name":"Saintpaulia ionanthaAloe barbadensisPilea cadiereiHippeastrumSyngonium podophyllumPilea microphyllaProtasparagus setaceusSoleirolia soleiroliiopenMusa nanaBegonia rex-cultorumStrelitzia reginaedirectAsplenium nidusThunbergia alataIresine herbstiiNephrolepis exaltataBougainvilliaJusticia carneaPinguicula vulgarissealedPellaea rotundifoliaCaladium bicolorSchlumbergera buckleyiLycopodium clavatumDarlingtonia californicashould be growncanCoffea arabicaCodiaeum variegatumEuphorbia miliisome direct sunCyclamen persicumDieffenbachiaDracaena marginataCryptanthus bromelioidesRhipsalidopsis gaertneriLilium longiflorum(June?)Portulacaria afraPhilo. bipinnatifidumSchefflera elegantissimaSchefflera elegantissimaCrossandra infundibuliformisClivia miniataEpiscia dianthifloraAnthurium speciesAbutilon hybridumP. densiflorus 'Meyeri'Pilea involucrataGardenia jasminoidesSinningia hybridushollow side upEpipremnum aureumPachystachys luteaHaworthia attenuataPhil. scandensEcheveria elegansEcheveria imbricataSempervivum tectorumBegonia masonianaHedera helixCrassula argenteaFatsia japonicaSolanum pseudocapsicumKalanchoe blossfeldianaLantana camaraAeschynanthus radicansAdiantum raddianumCitrus mitisPilea depressaPilea 'Moon Valley'sometimes you have to use your imagination..Rhoeo discolorFittonia verchaffeltiiAraucaria heterophyllaslightly cooler at nightColeus blumeiKalanchoe tomentosaChamaedorea elegans(or misting)Passiflora incarnataSpathiphyllum floribundum(never soggy)AlstroemeriaNertera granadensisSarracenia purpureaEcheveria pulvinataCalceolariaCalceolaria  crenatifloraEuphorbia pulcherimaHypoestes phyllostachyaCalliandraCalliandra haematocephalaMaranta leucoreuraOpuntia vulgarisGynura aurantiacaGoodyera pubescensBegonia hybridslightlyCeropegia woodiiFicus elasticaOxalis oregonaSansevieria trifasciatasparingly but regularlyChlorophytum comosumpreferPhil. pertusumP. densiflorus 'Sprengeri'Saxifraga stoloniferaDrosera capensisPlectranthus australisGibasis geniculata(not Tahiti)Zygocactus truncatusSedum spurium tricolorDionaea muscipulaTradescantia zebrinaPeperomia sandersiiBegonia semperflorensGaultheria procumbensAphelandra squarrosa","science":"African VioletSee Web PageAloe VeraSee Web PageAluminum PlantSee Web PageAmaryllisforce into bloomgift plantSee Web PageArrowhead VineSee Web PageArtillery Plantterrarium environmentsSee Web PageAsparagus FernSee Web Pagedish gardensopen terrariumsCan be propagated by divisionBanana Plantsfeeding when actively growing with soluble 20-20-20 fertilizerSee Web PageBegonia RexSee Web PageBird of ParadiseSee Web PageBlack Eyed Susan VineSee Web PageBoston FernsSee Web PageBougainvilleSee Web PageBrazilian Plume FlowerUSDA Zones 9-11See Web PageButterwortsSee Web PageSusceptible to attacks from scale insectsCaladiumFeed every 6 weeks with a liquid 6-6-6 fertilizerSee Web PageMitre FlowerSee Web PageChristmas CactusSee Web PageChristmas TreesSee Web PageCan be propagated by cuttingsCobra LilySee Web PageCoffee Plantsoluble, 10-10-10 fertilizerSee Web PageCrotonSee Web PageCrown of ThornsCan be propagated by cuttingsSee Web PageCyclamenSee Web PageDieffenbachiaSee Web PageDragon Treeair layeringcuttingsSee Web PageSusceptible to mealy bugs and scale insectsEaster CactusSee Web PageEaster LiliesSee Web PagePropagate by softwood cuttingsElephant Ear Philodendronliquid house plant fertilizerSee Web PageFalse AraliaFirecracker FlowerSee Web PageFire LilySee Web PageFlamingo FlowerSee Web PageFlowering MaplefertilizerSee Web PageFoxtail FernSee Web PageFriendship PlantSee Web PageGardeniawith an acidifying fertilizerSee Web PageGloxiniaSee Web PageGolden PothosSee Web PageGolden Shrimp PlantSee Web PageFeed in spring and again in the fall with half strength house plant fertilizerHeart Leaf PhilodendronSee Web PagePropagation is by softwood cuttingsIron Cross BegoniaSee Web PageIvyFeed monthly with half strength, balanced fertilizerSee Web PageJade plantSee Web PageJapanese Araliashade gardenpalmate leavesSee Web PageJerusalem Cherryliquid 5-10-5 blooming house plant fertilizerSee Web PageKalanchoeSee Web PageLantanaSee Web PageLipstick PlantSee Web PageMaidenhair FernSee Web PageMiniature Orange TreeSee Web PageMiniature PeperomiaSee Web PageMoon ValleyExcellent for terrariums or dish gardensSee Web Pagesoftwood cuttingsPropagate by softwood cuttings kept @ 75°Norfolk Island PineSee Web PageOrchidsOrnamental PeppersSow seeds of Ornamental Peppers into potsPainted NettlePropagate with cuttingsgrow from seed½ strength liquid house plant fertilizerSee Web PageFeed monthly when actively growingPropagation is by softwood cuttingsParlor PalmFeed in spring and summer onlySee Web PagePassion Flower10-5-20 ratio fertilizerPropagate with cuttingsgrow from seedPeace lilyliquid 20-20-20 fertilizerPeruvian LilySee Web PagePin Cushion PlantPitcher PlantsPropagation is by softwood cuttingsPouch FlowerSee Web PagePoinsettiaSee Web PagePolka Dot PlantPowder Puff Treeover-winter your plant indoorsSee Web PagePrayer PlantFeed with balanced \"acid fertilizer\"Prickly Pear CactusFeed monthly with ½ strength, house plant food when growingPurple Passion PlantPropagation is by softwood cuttingsslightly acidic soilFeed with compost teaPropagate by division in the springRieger Begoniadilute, water soluble houseplant fertilizer (15-30-15)Rosary VineFeed monthly with ½ strength house plant foodRubber Plantswith ½ strength house plant foodShamrocksall purpose house plant foodSnake PlantSpider PlantFeed every 3 months with house plant fertilizerSplit Leaf Philodendronliquid house plant fertilizerSprenger's AsparaguscladodesSee Web PageStrawberry BegoniaFeed monthly in summer with house plant fertilizerSundewSwedish IvyColeusracemesSee Web PageThanksgiving CactusPropagation is by softwood cuttingsVenus Fly TrapWandering JewFeed monthly while growing, with ½ strength house plant foodPropagate with softwood cuttings.Feed monthly in spring and summer with half-strength house plant foodWax BegoniaBegonia semperflorensSee Web PageZebra PlantAphelandra squarrosaSee Web Page","description":"Zebra Plants are extremely showy evergreen plants with pairs of shiny, 6\"-9\", lance shaped green leaves, boldly variegated with cream, white or silvery striped veins. Under ideal conditions, they can be persuaded to bloom. Only hardy in zones 11-12. See Web Page"},{"name":"Saintpaulia ionantha","science":"African Violet","description":"African Violets were first collected from eastern Africa and Tasmania in the late nineteenth century. Their attractive, velvety foliage, compact growing habit and wide variety of long blooming flower colors have made the African Violet the most popular flowering house plant in the world. See Web Page"},{"name":"Aloe barbadensis","science":"Aloe Vera","description":"There are over 250 species of Aloes in the world, mostly native to Africa. They range in size from little one inch miniatures to massive plant colonies consisting of hundreds of 2 foot diameter plants. The most commonly known is the Aloe barbadensis, better known as the Aloe Vera. See Web Page"},{"name":"Pilea cadierei","science":"Aluminum Plant","description":"Aluminum Plants are fast growing, easy to care for plants that branch freely and grow 12\"-18\" tall. These plants have 3\", deep green, lance shaped leaves arranged in pairs along their upright, succulent stems. The fleshy leaves are accented with bold bands of metallic silver. See Web Page "},{"name":"Hippeastrum","science":"Amaryllis","description":"Nothing can break the gloom in the dead of the winter like a beautiful blooming House Plant. Of all of the flowering bulbs, the Amaryllis is the easiest to force into bloom. Their large, showy flowers, and easy care make the Amaryllis an extremely popular gift plant during the holiday seasons. See Web Page"},{"name":"Syngonium podophyllum","science":"Arrowhead Vine","description":"Syngoniums are fast growing vines that grow to about 3 ft. Easy to grow plant for bright indirect light or light shade. Allow rich, well draining soil to dry before watering. Pinch tips to induce bushiness. Green, copper, and variegated varieties are available. See Web Page"},{"name":"Pilea microphylla","science":"Artillery Plant","description":"The Artillery Plant forms an umbrella like canopy of tiny, bright green leaves on fleshy, 6\"-12\" stems. The name Artillery Plant comes from the way that its seed pods forcibly eject their pollen or seeds when the frond is touched. An excellent plant for terrarium environments. See Web Page"},{"name":"Protasparagus setaceus","science":"Asparagus Fern","description":"The Asparagus Fern is a very popular plant for florists who commonly use the lacy, horizontal fronds in flower arrangements. These decorative vines will grow up to 10 feet with support, or they can be kept to a more compact size by regularly removing the tips from new growth. See Web Page"},{"name":"Soleirolia soleirolii","science":"","description":"Excellent, moss-like ground cover plant for dish gardens and open terrariums. Needs moderate light. Soil should be kept constantly moist but water on the tiny foliage should be avoided. Can be propagated by division. May become a nuisance but is easily controllable. "},{"name":"Musa nana","science":"Banana Plants","description":"Needs rich, humus soil and a monthly heavy feeding when actively growing with soluble 20-20-20 fertilizer. Needs bright light, but protection from hot afternoon sun. Mist leaves often, and sponge them off when dusty. Fun to grow from seeds or offsets. See Web Page"},{"name":"Begonia rex-cultorum","science":"Begonia Rex","description":"Known for the beautiful painted patterns on the foliage. Rex Begonia leaves vary considerably in texture, size, shape, patterns and colors. The small pink or white flowers may appear at any time of the year are insignificant compared to the foliage. See Web Page"},{"name":"Strelitzia reginae","science":"Bird of Paradise","description":"Grow best with at least 4 hours of direct sunlight, but should have bright light all day. Plant in mix of potting soil, peat moss, and sand with bone meal added. Good drainage essential. Keep the soil evenly moist when growing. Hardy in zones 9-12 See Web Page"},{"name":"Asplenium nidus","science":"","description":"A tropical, epiphytic fern that, in nature colonizes in trees or on rock faces.\nRequires warmth, high humidity, moderate light and rich, well draining soil.\nLight green fronds slowly grow to 1-3 feet. Hardy in zones 11-12"},{"name":"Thunbergia alata","science":"Black Eyed Susan Vine","description":"The Black-Eyed Susan Vine is an evergreen, twining vine, most often grown as a long blooming annual. Black-Eyed Susan Vines have dark green, arrowhead-shaped, 3\" leaves. They produce a profusion of brightly colored, 1½\" bell-shaped flowers from early summer, well into the fall. See Web Page"},{"name":"Iresine herbstii","science":"","description":"Small, branching plant with blood red foliage, grows to 24\". Needs rich, loamy, well draining soil, and bright light with some sun. Keep soil evenly moist. Pinch tips to induce bushiness. Propagate by softwood cuttings in the spring. Hardy in zones 10-12"},{"name":"Nephrolepis exaltata","science":"Boston Ferns","description":"Boston Ferns like it cool, and they would be very happy to have a 60 degree room, with bright light. Since it doubtful you have a place that cool, I recommend that you keep your fern as far away from heat sources as possible, even at the sacrifice of some light.  See Web Page"},{"name":"Bougainvillia","science":"Bougainville","description":"Bougainvillias produce some of the showiest display of colors of all vines. Most cultivars have an upright growth habit, but there are many shrubby varieties and creeping types as well.  See Web Page"},{"name":"","science":"","description":"\n\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n"},{"name":"Justicia carnea","science":"Brazilian Plume Flower","description":"The Brazilian Plume Flower is a shade loving, tropical evergreen perennial shrub with large deep green leaves. It produces a never ending show of large spikes of brightly colored, tubular flowers from spring to fall. USDA Zones 9-11. See Web Page"},{"name":"Pinguicula vulgaris","science":"Butterworts","description":" Should be grown in a mixture of sphagnum moss, peat moss and perlite, need several hours of sun each day. Butterworts require a varying amounts of moisture, but always less when dormant. Not suitable for sealed terarriums. See Web Page "},{"name":"Pellaea rotundifolia","science":"","description":"This low growing, spreading fern from Australia prefers bright indirect light, protection from drafts and evenly moist soil. Fills in any space quickly.\nSusceptible to attacks from scale insects. Hardy in zones 9-11"},{"name":"Caladium bicolor","science":"Caladium","description":"Frost tender perennial tubers. They like heat, plenty of moisture and humidity and bright indirect light. Plant tuber, knobby side up, 2\" below surface of rich, well draining soil. Feed every 6 weeks with a liquid 6-6-6 fertilizer. See Web Page"},{"name":"","science":"Mitre Flower","description":"The Chilean Mitre Flower is a gorgeous creeping and climbing, plant with glossy, dark green leaves arranged in pairs along woody stems. They produce an abundance of intensely colored, scarlet-orange, tubular 1½\" flowers with a soft, velvety texture. See Web Page"},{"name":"","science":"Christmas Cactus","description":"Christmas Cactus have a much less pronounced 'claw' on the edges of the leaf segments than Thanksgiving Cactus. Most Christmas Cactus sold today are hybrids of the original, red flowering Schlumbergera buckleyi. Flowers may be pink, red, orange, white or lavender. See Web Page"},{"name":"","science":"Christmas Trees","description":"Living trees can only be kept indoors for ten days. Keep in a garage or unheated area for a few days before bringing indoors, to lessen shock. Keep out of direct sunlight, and away from heat sources. Avoid heat producing lights. Keep soil moist. See Web Page"},{"name":"Lycopodium clavatum","science":"","description":"Best grown in a terrarium environment, this creeping moss needs cooler temperatures, low to moderate light, good air circulation and moist, rich soil.\nCan be propagated by cuttings. Hardy in zones 6-9"},{"name":"Darlingtonia californica","science":"Cobra Lily","description":"Cobra Lilies like bright light but not direct sunlight. They should be grown in live sphagnum moss, but can be grown in a mix of peat moss and perlite.  Keep potting mix constantly wet. Can withstand temperatures from 32°-100°. See Web Page"},{"name":"Coffea arabica","science":"Coffee Plant","description":"Grow best in filtered sunlight @ 65° nights, 75° days. Plant in fast draining potting soil . Keep soil moist, but never soggy. Feed every 2 weeks from Mar. to Oct. then monthly from Nov. thru Feb. with soluble, 10-10-10 fertilizer. Hardy in zones 10-12. See Web Page"},{"name":"Codiaeum variegatum","science":"Croton","description":"Crotons are tender perennial plants that will grow to three feet tall or more. They are most often grown as house plants or in a greenhouse environment. Their thick, glossy foliage is brightly colored in combinations and shades of red, yellow, pink, orange, burgundy, bronze or green. See Web Page"},{"name":"Euphorbia milii","science":"Crown of Thorns","description":"Crown of Thorns plants should have some direct sun each day. Water once a week when in growth, once a month while dormant, but never water if the soil is not dry. \nCan be propagated by cuttings. The milky, white sap is VERY poisonous! See Web Page"},{"name":"Cyclamen persicum","science":"Cyclamen","description":"The most important criteria for successfully growing a Cyclamen as a houseplant are cool temperatures, fresh air, and ample moisture. Will bloom from December until April if kept cool and happy. Dead flower and leaves should be removed with a sharp tug. See Web Page"},{"name":"Dieffenbachia","science":"","description":"Dieffenbachias grow best in bright indirect light with temperatures above 55° degrees. The ideal temperatures are 70°-80°  days and 60°-65° nights. Let soil dry moderately before watering. The sap of the Dieffenbachia is extremely toxic! See Web Page"},{"name":"Dracaena marginata","science":"Dragon Tree","description":"Tree-like plant that is tolerant of lower light but appreciates bright, indirect light. Allow to dry slightly between waterings. Sensitive to fluoride, so allow water to set for 24 hours before watering. Propagate by air layering or cuttings. See Web Page"},{"name":"Cryptanthus bromelioides","science":"","description":"Rosette forming, epiphytic Bromeliad from Brazil will grow to 12\". Needs bright light but no direct sun and high humidity. Should be planted in a potting mix containing sphagnum moss or peat. Susceptible to mealy bugs and scale insects."},{"name":"Rhipsalidopsis gaertneri","science":"Easter Cactus","description":"The 2 \" leaf segments of the Easter Cactus are oval and smooth edged.\nShort tufts of brown hair often appear at the segment joints.\nThe long blooming flowers of the Easter Cactus are bright red. See Web Page"},{"name":"Lilium longiflorum","science":"Easter Lilies","description":"Prefers a bright window, with daytime temperatures of 60°-65°, well-drained soil which is kept moderately moist. Avoid over watering. When the soil temperatures have warmed sufficiently (June?), you can transplant your lily outdoors. See Web Page"},{"name":"Portulacaria afra","science":"","description":"Prefers bright light but will endure in moderate light. Pot in a 50/50 mix of coarse sand potting mix. Allow soil to dry before watering, except in fall and winter only water once every 2-3 months. Propagate by softwood cuttings"},{"name":"Philo. bipinnatifidum","science":"Elephant Ear Philodendron","description":"Philodendrons prefer moderately bright. Keep the soil evenly moist, but allow to dry out between waterings, slightly drier in winter months. Feed in the spring and again in mid summer with a liquid house plant fertilizer. See Web Page"},{"name":"Schefflera elegantissima","science":"False Aralia","description":"False Aralias are small, tropical evergreen trees that are native to the islands of the South Pacific. In their native environment, Schefflera elegantissima can grow up to 26 feet tall, but when grown in pots or planters they seldom reach more than 4-6 feet tall."},{"name":"Crossandra infundibuliformis","science":"Firecracker Flower","description":"Crossandras prefer bright filtered light, in warm temperatures (75°) with relatively high humidity, so set planter on tray filled with moist stones. Allow soil to dry slightly before watering. They will not tolerate temperatures below 60°! See Web Page"},{"name":"","science":"","description":"\n\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n"},{"name":"Clivia miniata","science":"Fire Lily","description":"Should be grown in bright indirect light and kept at 65°-75° while growing. Feed monthly with house plant food when growing and mist the plant occasionally. Blooms best when pot bound. Requires dormancy from Oct. to Jan. when they can be kept cooler. See Web Page"},{"name":"Episcia dianthiflora","science":"","description":"Trailing, 6\" relative of the African Violet from South America. Requires constant warmth and humidity, bright indirect light and should be planted in a porous, peaty potting mix. Keep soil moist at all times.  Hardy in zones 10-12"},{"name":"Anthurium species","science":"Flamingo Flower","description":"Flamingo Flower plants are durable and fairly easy to grow house plants that will thrive for many years under ideal conditions and can even survive for a year or two in the most adverse situations. They need bright light but never full sun, and high humidity. See Web Page."},{"name":"Abutilon hybridum","science":"Flowering Maple","description":"Grow best in filtered sunlight at about 70° days and 60°-65° nights. Require well draining but evenly moist soil. Feed monthly when new growth begins, alternating between \n½ strength all purpose then ½ strength bloom type liquid fertilizer. See Web Page"},{"name":"P. densiflorus 'Meyeri'","science":"Foxtail Fern","description":"Foxtail Ferns produces arching two foot 'fronds' of dense light green needles, creating the illusion of a pack of upright fox tails. Tiny white flowers in the summer are followed by bright red berries in the fall. Foxtail Ferns are very similar to Sprenger's Asparagus except much denser. See Web Page"},{"name":"Pilea involucrata","science":"Friendship Plant","description":"Friendship Plants are native to Central and South America, where they are known as Panamiga plants.They are creeping plants that form dense, 8\"-12\" tall mounds of deeply textured, oval, 2½\" leaves. The foliage color varies, but the most common variety has dark, reddish brown leaves gilded with silver or copper. See Web Page"},{"name":"Gardenia jasminoides","science":"Gardenia","description":"Gardenia requirements are very exact. Flower buds will fail to form if day temperatures are over 70° or night temperatures are over 65° or below 60°. Feed every three weeks while growing with an acidifying fertilizer. See Web Page"},{"name":"Sinningia hybridus","science":"Gloxinia","description":"Gloxinias require bright light but not direct sun, and should be grown in a humid area at 60°-75°. Plant tuber, hollow side up, in rich, light soil. Water sparingly until first leaves begin to grow, then gradually increase. Blooms for 3-4 months. See Web Page"},{"name":"Epipremnum aureum","science":"Golden Pothos","description":"Golden Pothos are one most popular of all house plants. They are attractive, durable and easy to grow vines that have smooth, leathery, heart shaped leaves with distinctive marbling alternating along rope-like green stems. Pothos vines are among the top ten air purifying plants for indoor use. See Web Page"},{"name":"Pachystachys lutea","science":"Golden Shrimp Plant","description":"Golden Shrimp Plants are also known as Golden Candle plants or Lemon Lollipop Flowers. They are 18\"-24\" tall, shrubby plants that form clumps of upright stems that are each tipped with brightly colored, 4\" golden yellow bracts. See Web Page"},{"name":"Haworthia attenuata","science":"","description":"Grow in moderate light. Pot in a 50/50 mix of coarse sand and potting mix. Allow soil to approach dryness before watering. Feed in spring and again in the fall with half strength house plant fertilizer. Propagate by offsets."},{"name":"Phil. scandens","science":"Heart Leaf Philodendron","description":"Climbing or hanging plant with dark green, 2-3\" heart shaped leaves. Tolerates low light and low humidity well. Prefers to be kept slightly root bound in rich, moist soil. Provide a bark type support for climbing. Hardy in zones 11-12. See Web Page"},{"name":"Echeveria elegans","science":"","description":"Plant in rich, sandy soil and give at least 4 hours of direct sun every day. Prefers warm days(70-75°) and cooler nights (50-60°) Allow soil to dry before watering. Propagate by removing offsets and rooting them, or by seed."},{"name":"Echeveria imbricata","science":"","description":"Forms six inch, ground hugging rosettes. Plant in rich, sandy soil and give plenty of bright light every day. Prefers warm days(70-75°) and cooler nights (50-60°) Allow soil to dry before watering. Propagation is by offsets"},{"name":"Sempervivum tectorum","science":"","description":"Should be grown in bright sunlight, in light, well draining soil. Water liberally, then allow the soil to dry out completely before watering again. Propagation is by softwood cuttings in the spring or summer.  Hardy in zones 10-12"},{"name":"Begonia masoniana","science":"Iron Cross Begonia","description":"Iron Cross Begonias have some of the most unique foliage in the plant world. Each heavily textured, bristly, light green leaf bears a reddish-brown marking resembling the Iron Cross used on shields and flags during the Crusades of medieval times. See Web Page\n"},{"name":"Hedera helix","science":"Ivy","description":"Ivy grows best with four or more hours a day of direct sunlight but will grow fairly well in bright indirect light. Keep soil evenly moist. Pinch tips to induce bushiness\nFeed monthly with half strength, balanced fertilizer. See Web Page"},{"name":"Crassula argentea","science":"Jade plant","description":"Jade plants should be grown in very bright sunlight with low humidity and temperatures of 55° nights and 75°-80° during the day. Plant in a 50/50 mix of potting soil and coarse sand with bone meal added. Allow to dry between waterings. See Web Page"},{"name":"Fatsia japonica","science":"Japanese Aralia","description":"Japanese Aralias are one of the easiest of all shade garden or house plants to grow and care for. They have large dark green, palmate leaves and form tropical looking, evergreen shrubs that can grow up to 6-8 feet tall and 6 feet wide but can be limited to a height of 2-4 feet with pruning. See Web Page"},{"name":"Solanum pseudocapsicum","science":"Jerusalem Cherry","description":"Jerusalem Cherries require full sun to thrive, but will survive with moderately bright light. Plant in rich, well drained potting soil, and keep moist while growing. Feed with a liquid 5-10-5 blooming house plant fertilizer every two weeks while actively growing. See Web Page"},{"name":"Kalanchoe blossfeldiana","science":"Kalanchoe","description":"Kalanchoes are easy to grow, winter blooming plants with waxy, green, scalloped edged  leaves, and clusters of tiny, brightly colored flowers that continue for 6 weeks or longer. Most Kalanchoes that are commonly available today are dwarf hybrids that only reach 8\"-12\" tall. See Web Page"},{"name":"Lantana camara","science":"Lantana","description":"Lantanas should be planted in a rich, fast draining soil and grown in a bright, sunny spot with night temperatures at about 60°. Allow the soil to dry between waterings. Take cuttings in the spring and keep the buds pinched off until fall for flowers during the winter months. See Web Page"},{"name":"Aeschynanthus radicans","science":"Lipstick Plant","description":"Lipstick Plants have thick, glossy, dark green leaves growing in pairs along their long, woody stems. Each vine is tipped with clusters of 2\" tubular, scarlet red flowers in mid-summer. As house plants they are most often grown in hanging baskets but can to climb up a three foot totem as well. See Web Page"},{"name":"Adiantum raddianum","science":"Maidenhair Fern","description":"Delta Maidenhair Ferns are elegant, fast growing, evergreen foliage plants with delicate, lacy fronds that are held on wiry, 6\"-12\" black stems.  Maidenhair fronds are composed of bright green, triangular leaflets and can grow up to 12\" wide and 18\" long. See Web Page"},{"name":"Citrus mitis","science":"Miniature Orange Tree","description":"Dwarf citrus trees such as oranges, lemons, and limes are living conversation pieces, providing year-round enjoyment with shiny foliage, bright fruits, and fragrant blossoms. Dwarf citrus are well adapted to container growing indoors. See Web Page"},{"name":"Pilea depressa","science":"Miniature Peperomia","description":"Miniature Peperomias are low growing, creeping plants with pairs of tiny, opposing round leaves on rigid stems that readily root at each node that contacts the soil. This Pilea prefers lower humidity and drier soil. A nice, but fairly plain plant for hanging baskets or to cover the soil in large planters. See Web Page"},{"name":"Pilea 'Moon Valley'","science":"Moon Valley","description":"Moon Valley is cool little  plant that grows to about 12\" tall. Their greatest feature is their saw toothed edged, chartreuse leaves with deep texturing like the craters and valleys on the moon. (sometimes you have to use your imagination..) Excellent for terrariums or dish gardens. See Web Page"},{"name":"Rhoeo discolor","science":"","description":"12\" rosette forming plant with bi-colored olive green above, purple below leaves. Needs bright indirect light and moist, rich, peaty soil. Avoid sudden temperature changes or drafts. Propagate by softwood cuttings."},{"name":"Fittonia verchaffeltii","science":"","description":"Brightly colored pink or white veins paint a net over the oval leaves of this spreading 6-8\" tall plant. Needs bright indirect light and moist, rich soil.\nPropagate by softwood cuttings kept @ 75°. Hardy in zones 11-12"},{"name":"Araucaria heterophylla","science":"Norfolk Island Pine","description":"Norfolk Pines need bright light but never full sun, with day temperatures of 65° (slightly cooler at night). Keeps soil moist, but never soggy. Lack of sufficient humidity will cause tip browning, sudden temperature changes should be avoided. See Web Page\n"},{"name":"","science":"Orchids","description":"Orchids need 10-15 hours of bright indirect light each day. They require high humidity. They need to be planted in special orchid potting mixes with excellent drainage. Water weekly with rainwater or tap water that has set for 24-48 hours."},{"name":"","science":"Ornamental Peppers","description":"Ornamental Peppers are annual plants. They should be grown in full sun. Keep their soil evenly moist. Sow seeds of Ornamental Peppers into pots around May 1st if you would like your pepper plants to be fruiting at Christmas time."},{"name":"Coleus blumei","science":"Painted Nettle","description":"Plant in a light, quick draining potting mix. Grow in bright light or sun for best leaf color and fullest plant. Keep the soil evenly moist, but never soggy. Propagate with cuttings or grow from seed Feed monthly, with ½ strength liquid house plant fertilizer. See Web Page"},{"name":"Kalanchoe tomentosa","science":"","description":"Panda plants prefer average to warm temperatures, bright light and well draining soil.\nFeed monthly when actively growing but only every 2-3 months otherwise.Avoid water on foliage. Propagation is by softwood cuttings "},{"name":"Chamaedorea elegans","science":"Parlor Palm","description":"Slow growing but may become too tall for dish gardens (12-30\"). Should be grown in a warm (75°-85°) area with bright indirect light with high humidity (or misting). Keep soil evenly moist. Feed in spring and summer only. Hardy in zones 11-12. See Web Page"},{"name":"Passiflora incarnata","science":"Passion Flower","description":"Needs bright indirect light, and well draining soils. During the growing season, the soil should be kept evenly moist. Apply a 10-5-20 ratio fertilizer in the early spring and early summer. Hardy in USDA zones 5-9 Propagate with cuttings or grow from seed"},{"name":"Spathiphyllum floribundum","science":"Peace lily","description":"Peace lilies will grow well in almost any moist (never soggy), well drained soil. They prefer bright filtered light in 68°-85 degree° days with 10° cooler nights. Keep out of drafts. Feed every 2-3 months with liquid 20-20-20 fertilizer."},{"name":"Alstroemeria","science":"Peruvian Lily","description":"Alstroemerias are low maintenance, long lived plants that are prized for their usability in cut flower bouquets.\nThere are about fifty species of Alstroemeria that were discovered in South America in the 18th century. Most commonly available Peruvian Lilies are hybrids of different species.\n See Web Page"},{"name":"Nertera granadensis","science":"Pin Cushion Plant","description":"The Pin Cushion Plant should be kept in a sunny location with a room temperature of 65-70 degrees. When active growth slows during the winter, watering should be cut back. Produces lots of tiny orange berries just in time for halloween!"},{"name":"Sarracenia purpurea","science":"Pitcher Plants","description":"The coloring of the plant will be much more intense if it receives some full sun each day, but will grow in partial shade. Should be grown in a mixture of live Sphagnum moss, medium orchid bark and charcoal. Kept very wet during the growing season."},{"name":"Echeveria pulvinata","science":"","description":"Plant in rich, sandy soil and give plenty of bright light every day. Prefers warm days(70-75°) and cooler nights (50-60°) Allow soil to dry before watering. Avoid getting water on the foliage. Propagation is by softwood cuttings."},{"name":"Calceolaria","science":"Pouch Flower","description":"There are about 300 species of Calceolaria, but the vast majority of those commonly cultivated are hybrids of the Chilean species Calceolaria  crenatiflora. They are commonly known as Pocketbook Plants, Pouch Flowers or Slipper Flowers. Normally grown as annual plants. See Web Page"},{"name":"Euphorbia pulcherima","science":"Poinsettia","description":"Poinsettia Plants were first brought into the United States in 1825 by Joel Robert Poinsett, while he was serving as the first U.S. ambassador to Mexico. When he returned to the United States, he sent the plants to different botanical gardens all around the world. See Web Page"},{"name":"Hypoestes phyllostachya","science":"Polka Dot Plant","description":"The Polka Dot plant grows best in a humid environment, needs bright light but not full sun. Use water that has been allowed to set for 24 hours to keep the soil slightly moist. Pinch back for bushiness. Hardy in zones 10-12"},{"name":"Calliandra","science":"Powder Puff Tree","description":"Calliandra haematocephala, commonly known as the Powder Puff Tree grow up to 10 feet tall with an equal spread, but dwarf, 3-6 foot varieties are also available, which are more appropriate in colder regions where you will need to over-winter your plant indoors.\n See Web Page"},{"name":"Maranta leucoreura","science":"Prayer Plant","description":"Need very high humidity, medium or bright filtered light and well drained soil, slightly peaty soil. Keep the soil evenly moist except when dormant. Feed with balanced \"acid fertilizer\" every 2 weeks when actively growing. Hardy in zones 11-12"},{"name":"Opuntia vulgaris","science":"Prickly Pear Cactus","description":"Easy to grow in a sunny window, yellow flowers with red centers. Allow plant to soak up water from bottom for a few hours, then allow to dry completely before watering again.Feed monthly with ½ strength, house plant food when growing."},{"name":"Gynura aurantiaca","science":"Purple Passion Plant","description":"Passion Plants need bright light but must be protected full sun. Keep the soil evenly moist. Feed every 2-3 weeks with half-strength house plant food when growing. Add peat moss to the potting mix. Propagation is by softwood cuttings "},{"name":"Goodyera pubescens","science":"","description":"This native woodland orchid requires shade, cool temperatures and moist, slightly acidic soil. Feed with compost tea in the spring and again in mid summer.\nPropagate by division in the spring. Hardy in zones 6-9"},{"name":"Begonia hybrid","science":"Rieger Begonia","description":"Rieger Begonias need bright, filtered light, with maximum light in winter. Allow soil to dry slightly between waterings. Provide additional humidity. Feed monthly while in bud or bloom with a dilute, water soluble houseplant fertilizer (15-30-15)."},{"name":"Ceropegia woodii","science":"Rosary Vine","description":"The slender flowers resemble a small pink vase. Needs bright light (morning sun is ok), summer temperatures around 70°-75°, but keep cooler in winter. Do not over water.\nFeed monthly with ½ strength house plant food when growing."},{"name":"Ficus elastica","science":"Rubber Plants","description":"Rubber plants like bright light, but never hot sun. Keep out of drafts and away from heat sources. Keep evenly moist while growing but dryer during the rest of the year. Fertilize once in spring and again in early summer with ½ strength house plant food"},{"name":"Oxalis oregona","science":"Shamrocks","description":"Shamrocks grow best when the receive cool fresh air, growing in moist soil and receive bright light but not direct sun. Require a dormant period each year, after which resume watering and give a shot of all purpose house plant food"},{"name":"Sansevieria trifasciata","science":"Snake Plant","description":"A 3\"-3' tall sub-succulent that should always be watered sparingly but regularly, will survive in almost light from sun to shade.\nPrefers to be kept somewhat rootbound in poor soil. Hardy in zones 10-12"},{"name":"Chlorophytum comosum","science":"Spider Plant","description":"Need bright natural light or artificial grow lights, evenly moist soil, and prefer cooler temperatures. Decrease their light hours to simulate the shorter days of fall to produce 'babies'. Feed every 3 months with house plant fertilizer"},{"name":"Phil. pertusum","science":"Split Leaf Philodendron","description":"Philodendrons prefer moderately bright. Keep the soil evenly moist, but allow to dry out between waterings, slightly drier in winter months. Feed in the spring and again in mid summer with a liquid house plant fertilizer."},{"name":"P. densiflorus 'Sprengeri'","science":"Sprenger's Asparagus","description":"Sprenger's Asparagus is a branching perennial with wirey green stems that are sparsely covered with clusters of 3-4, ¾\" cladodes along the stem. They can be trained to scramble up a support, but are most often grown as hanging plants. Declared a noxious weed in Florida, Hawaii and New Zealand. See Web Page"},{"name":"Saxifraga stolonifera","science":"Strawberry Begonia","description":"This 'Mother of Thousands' spreads by strawberry-like, easily rooted runners. Needs moderate light, cooler temperatures and moist, rich soil. Feed monthly in summer with house plant fertilizer. Nice hanging plant. Hardy in zones 5-10"},{"name":"Drosera capensis","science":"Sundew","description":"Grow in very bright light but not direct sun. keep constantly moist. Pot in mix of peat and sphagnum moss with perlite added. Water with distilled or rain water. Keep very warm in Summer (75°-100°) and 45° in the winter when dormant."},{"name":"Plectranthus australis","science":"Swedish Ivy","description":"Swedish Ivy is a fast growing, spreading, evergreen perennial plant from South Africa that is closely related to the Coleus. They have slightly rounded, waxy, glossy green, 1½\"-2\" leaves with scalloped edges, and produce 3\"-8\" racemes of pink, lilac or white flowers. See Web Page"},{"name":"Gibasis geniculata","science":"","description":"Creeping or hanging plant, native to Jamaica (not Tahiti). Prefers bright indirect light, high humidity and moderately rich, well draining soil. Allow the soil to dry moderately before watering. Hardy in zones 11-12"},{"name":"","science":"Thanksgiving Cactus","description":"The Thanksgiving Cactus was originally named Zygocactus truncatus. It sometimes goes by the name of the Crab Cactus. The most distinguishing trait of S.truncata is the claw toothed edges on each leaf segment. The flowers may be pink, red, orange or white."},{"name":"Sedum spurium tricolor","science":"","description":"Should be grown in bright sunlight, in rich, sandy soil. Water liberally, then allow the soil to dry out completely before watering again. Propagation is by softwood cuttings in the spring or summer.  Hardy in zones 10-12"},{"name":"Dionaea muscipula","science":"Venus Fly Trap","description":"Should be grown in warm, humid environment with very bright light but not direct sun. Keep constantly moist. Pot in mixture of 70% peat or sphagnum moss and 30% perlite or pumice. Water with distilled or rain water."},{"name":"Tradescantia zebrina","science":"Wandering Jew","description":"Grows best in full sun or bright light. Water moderately, except keep constantly moist when growing. Feed monthly while growing, with ½ strength house plant food.\nExcellent hanging plant. Propagate with softwood cuttings. Hardy in zones 9-12"},{"name":"Peperomia sandersii","science":"","description":"Mound growing plant to 12\". Needs bright light but must be protected full sun. Keep the soil evenly moist in warm weather but allow to dry before watering in winter. Feed monthly in spring and summer with half-strength house plant food."},{"name":"Begonia semperflorens","science":"Wax Begonia","description":"Wax Begonias have succulent stems and waxy, deep green to dark mahogany colored foliage, and they produce loose clusters of single or double, white, pink or red flowers from May until October. See Web Page"},{"name":"Gaultheria procumbens","science":"","description":"This aromatic, six inch tall woodland mini-shrub is a source of wintergreen oil used in liniments. Needs moderate light, cool temperatures and rich, moist soil. has white flowers in the summer, bright red berries in winter. Hardy in zones 4-9"},{"name":"Aphelandra squarrosa","science":"Zebra Plant","description":"Zebra Plants are extremely showy evergreen plants with pairs of shiny, 6\"-9\", lance shaped green leaves, boldly variegated with cream, white or silvery striped veins. Under ideal conditions, they can be persuaded to bloom. Only hardy in zones 11-12. See Web Page"},{"name":"","science":"","description":"\n "}]